#ifndef _MAGIC_BOOK
#define _MAGIC_BOOK
#include "spell.hpp"

class Magic_book
{
private:
        /* data */
public:
        Magic_book(/* args */);
        ~Magic_book();
};

#endif
// Да се реализира клас магическа книга, която съдържа страници със заклинания, 
// всяко от които може да се използва точно веднъж (след това изчезва, заедно с цялата страница). 
// Понеже книгата не е каква да е книга, а магическа
//  – тя винаги има една празна страница накрая,давайки възможността на своя притежател
//  да дописва ново заклинание.
